
Процедура ПередЗаписью(Отказ)
	ТекстОшибки = "";
	Для НомерСимвола = 1 По СтрДлина(Наименование) Цикл	
		//Буква = Сред(Наименование, НомерСимвола, 1);
		КодБуквы = КодСимвола(Наименование, НомерСимвола);
		Если КодБуквы > 32 И КодБуквы < 48 Тогда
			ТекстОшибки = ТекстОшибки + "Недопустимый символ: " + Сред(Наименование, НомерСимвола, 1) + Символы.ПС;
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
