////////////////////////////////////////////////////////////////////////////////
// Модуль объекта справочника Счета.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ТекстОшибки = "";
	
	Для НомерСимвола = 1 По СтрДлина(Наименование) Цикл
		
		КодБуквы = КодСимвола(Наименование, НомерСимвола);
		
		Если КодБуквы > 32 И КодБуквы < 48 Тогда
			
			ТекстОшибки = ТекстОшибки + "Недопустимый символ: " + Сред(Наименование, НомерСимвола, 1) + Символы.ПС;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Поле = "Наименование";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
