
Процедура ИзменитьРазмерШрифтаЭлементов(Форма)Экспорт
	
	Шрифт12 = Новый Шрифт(,10,);
	Для Каждого СтрокаЭлемента Из Форма.Элементы Цикл
		
		Если ТипЗнч(СтрокаЭлемента) = Тип("ГруппаФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЭлемента.Шрифт = Шрифт12;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеКошельки()Экспорт
	
	ОбщийМодульСервер_СистемныеНастройки.ЗаполнитьПредопределенныеКошелькиНаСервере();
		
КонецПроцедуры

Процедура ВыполнитьДвиженияВФоне(МассивДанных)Экспорт

	ОбщийМодульСервер.ВыполнитьДвиженияВФоне(МассивДанных);

КонецПроцедуры 

	