
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Данные") Тогда 
		Данные = Параметры.Данные;
	КонецЕсли;
	
	Если Параметры.Свойство("Длина") Тогда 
		Длина = Параметры.Длина;
	Иначе
		Длина = 13;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокВопроса") Тогда 
		ЗаголовокВопроса = Параметры.ЗаголовокВопроса;
	КонецЕсли;	

	//ОбщийМодульСервер.НастроитьФормуПоЗначениямНастроек(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЦифровойБлок()
	
	Если ТипЗнч(ТекущийЭлемент) = Тип("КнопкаФормы") Тогда 
		
		Если Число(ТекущийЭлемент.Заголовок) < 10 Тогда 
			Если СтрДлина(Данные) > Длина-1 Тогда 
				Данные = "Ошибка длины данных";
			Иначе 
				Данные = Данные + ТекущийЭлемент.Заголовок;
			КонецЕсли;			
		КонецЕсли;
		
		Если Число(ТекущийЭлемент.Заголовок) = 200 Тогда //Ввод
			Если СтрДлина(Данные) > Длина Тогда 
				Возврат;
			КонецЕсли;	
			Закрыть(Данные);
		КонецЕсли;
		
		Если Число(ТекущийЭлемент.Заголовок) = 100 Тогда //Очистить
			Если ПустаяСтрока(СокрЛП(Данные)) Тогда 
				Закрыть(Данные);
			Иначе 
				Данные = "";
			КонецЕсли;	
		КонецЕсли;
		
		Если Число(ТекущийЭлемент.Заголовок) = 300 Тогда //Один символ
			Данные = Лев(Данные, СтрДлина(Данные)-1);
		КонецЕсли;
		
	КонецЕсли;	
	
	//Для Каждого Элемент Из Элементы Цикл 
	//	Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
	//		Если СтрНачинаетсяС(Элемент.Имя, "цб") Тогда 
	//			Элемент.Шрифт = Новый Шрифт(, ,10);
	//		КонецЕсли;	
	//	КонецЕсли;	
	//КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЦифровойБлок();
	
КонецПроцедуры

&НаСервере
Процедура СообщитьПользователю(ТекстСообщения)
	
	//ОбщийМодульСервер.СообщитьПользователю(ЭтотОбъект, ТекстСообщения);
	
КонецПроцедуры	

&НаСервере
Процедура ОчиститьСообщение()
	
	ОбщийМодульСервер.ОчиститьСообщение(ЭтаФорма);
	
КонецПроцедуры	
