////////////////////////////////////////////////////////////////////////////////
// Модуль управляемого приложения.
////////////////////////////////////////////////////////////////////////////////

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	ОбщийМодульСервер_СистемныеНастройки.ЗаполнитьПредопределенныеКошелькиНаСервере();
	
	Если Не ОбщийМодульСервер_СистемныеНастройки.НачальнаяНастройкаВыполнена() Тогда
		
		ОткрытьФорму("ОбщаяФорма.ФормаКонстант", , , , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры
