
&НаСервереБезКонтекста
Функция ПредопределенныйУзел(Узел)
	Возврат Узел = ПланыОбмена.Мобильные.ЭтотУзел();
КонецФункции

&НаКлиенте
Процедура УзелОбменаПриИзменении(Элемент)
	
	Если ПредопределенныйУзел(УзелОбмена) Тогда
		Элементы.ЗарегистрироватьИзменения.Доступность = Ложь;
		Элементы.ВыгрузитьДанные.Доступность = Ложь;
		Элементы.ЗагрузитьДанные.Доступность = Ложь;
	Иначе
		Элементы.ЗарегистрироватьИзменения.Доступность = Истина;
		Элементы.ВыгрузитьДанные.Доступность = Истина;
		Элементы.ЗагрузитьДанные.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьИзмененияНаСервере(Узел)
	ПланыОбмена.ЗарегистрироватьИзменения(Узел);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ЗарегистрироватьИзмененияНаСервере(УзелОбмена);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьДанныеНаСервере(Узел, Каталог)
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.ЗаписатьСообщениеСИзменениями(Каталог);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	//Диалог.Заголовок = "Укажите каталог информационной базы:";
	
	//Если Диалог.Выбрать() Тогда
	//	ВыгрузитьДанныеНаСервере(УзелОбмена, "/storage/sdcard0/");
	//КонецЕсли;
	ВыгрузитьДанныеНаСервере(УзелОбмена, "/storage/sdcard0/");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьДанныеНаСервере(Узел, Каталог)
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.ПрочитатьСообщениеСИзменениями(Каталог);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	//Диалог.Заголовок = "Укажите каталог информационной базы:";
	
	//Если Диалог.Выбрать() Тогда
	//	ЗагрузитьДанныеНаСервере(УзелОбмена, "/storage/sdcard0/");
	//КонецЕсли;
	ЗагрузитьДанныеНаСервере(УзелОбмена, "/storage/sdcard0/");

КонецПроцедуры
