
Функция ПолучитьПараметрЗапуска()Экспорт
	Возврат Константы.ПервыйЗапуск.Получить();
КонецФункции

Процедура ПрошелПервыйЗапуск()Экспорт
	Константы.ПервыйЗапуск.Установить(Истина);
КонецПроцедуры

Функция ПолучитьВалютуРегламентированногоУчета()Экспорт	
	Возврат Константы.ВалютаУчета.Получить();	
КонецФункции

Процедура ЗаполнитьПредопределенныеКошелькиНаСервере()Экспорт
	
	ПервыйЗапуск = Константы.ПервыйЗапуск.Получить();
	Если НЕ ПервыйЗапуск Тогда		
		СписокИменСчетов = ПолучитьСписокСчетов();
		Для Каждого ИмяСчета Из СписокИменСчетов Цикл
			СпрОбъект = Справочники.Счета[ИмяСчета].ПолучитьОбъект();
			Если ИмяСчета = "БанковскийСчет" Тогда
				СпрОбъект.ВидСчета = Перечисления.ВидСчета.БанковскийСчет;
			ИначеЕсли ИмяСчета = "Карта" Тогда
				СпрОбъект.ВидСчета = Перечисления.ВидСчета.БанковскаяКарта;
			ИначеЕсли ИмяСчета = "Кошелек" Тогда 
				СпрОбъект.ВидСчета = Перечисления.ВидСчета.Кошелек;
			КонецЕсли;
			Попытка
				СпрОбъект.Записать(); 
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьСписокСчетов()
	
	СписокИменСчетов = Новый Массив;
	СписокИменСчетов.Добавить("БанковскийСчет");
	СписокИменСчетов.Добавить("Карта");
	СписокИменСчетов.Добавить("Кошелек");
	
	Возврат СписокИменСчетов;
	
КонецФункции