
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.ИзменитьРазмерШрифтаЭлементов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", , ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборДаты" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если ЗначениеЗаполнено(Параметр.Время) Тогда
				Часов 		= Час(Параметр.Время);
				Минут 		= Минута(Параметр.Время);
				Секунд 		= Секунда(Параметр.Время);
				ВсегоСекунд = Часов*3600 + Минут*60 + Секунд;
			Иначе
				ВсегоСекунд = 0;
			КонецЕсли;
			
			Объект.Дата = Параметр.Период + ВсегоСекунд;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
