////////////////////////////////////////////////////////////////////////////////
// Модуль объекта документа Расход.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сумма расхода должна быть больше нуля.";
		Сообщение.Поле = "Сумма";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр Расходы
	Движения.Расходы.Записывать = Истина;
	Движение = Движения.Расходы.Добавить();
	Движение.Период = Дата;
	Движение.КатегорияРасходов = КатегорияРасхода;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	
	// регистр Баланс
	Движения.Баланс.Записывать = Истина;
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Счета = Счет;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

#КонецОбласти
