
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Доходы 
	Движения.Доходы.Записывать = Истина;
	Движение = Движения.Доходы.Добавить();
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.КатегорииДоходов = КатегорияДоходов;
	Движение.Сумма = Сумма;
	
	// регистр Баланс
	Движения.Баланс.Записывать = Истина;
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.Счета = Счет;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

