////////////////////////////////////////////////////////////////////////////////
// Форма документа Доходы.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Дата = ТекущаяДата();
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.ИзменитьРазмерШрифтаЭлементов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СуммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаСуммыСКлавиатуры", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВводСуммы(ОписаниеОповещения, Объект.Сумма, "Сумма дохода", "income");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммыСКлавиатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Сумма = Результат;
	
КонецПроцедуры

#КонецОбласти
